OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf46j53.h
#define _TMR1MD                 0x02
#define _PMDTMR1                0x02
#define _TMR2MD                 0x04
#define _PMDTMR2                0x04
#define _TMR3MD                 0x08
#define _PMDTMR3                0x08
#define _TMR4MD                 0x10
#define _PMDTMR4                0x10
#define _RTCCMD                 0x20
#define _PMDRTCC                0x20
#define _CTMUMD                 0x40
#define _PMDCTMU                0x40
#define _PSPMD                  0x80
#define _PMDPSP                 0x80

//==============================================================================


//==============================================================================
//        PMDIS1 Bits

extern __at(0x0EBA) __sfr PMDIS1;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned TMR1MD             : 1;
    unsigned TMR2MD             : 1;
    unsigned TMR3MD             : 1;
    unsigned TMR4MD             : 1;
    unsigned RTCCMD             : 1;
    unsigned CTMUMD             : 1;
    unsigned PSPMD              : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned PMDTMR1            : 1;
    unsigned PMDTMR2            : 1;
    unsigned PMDTMR3            : 1;
    unsigned PMDTMR4            : 1;
    unsigned PMDRTCC            : 1;
    unsigned PMDCTMU            : 1;
    unsigned PMDPSP             : 1;
    };
  } __PMDIS1bits_t;

extern __at(0x0EBA) volatile __PMDIS1bits_t PMDIS1bits;

#define _PMDIS1_TMR1MD          0x02
#define _PMDIS1_PMDTMR1         0x02
#define _PMDIS1_TMR2MD          0x04
#define _PMDIS1_PMDTMR2         0x04
#define _PMDIS1_TMR3MD          0x08
#define _PMDIS1_PMDTMR3         0x08
#define _PMDIS1_TMR4MD          0x10
#define _PMDIS1_PMDTMR4         0x10
#define _PMDIS1_RTCCMD          0x20
#define _PMDIS1_PMDRTCC         0x20
#define _PMDIS1_CTMUMD          0x40
#define _PMDIS1_PMDCTMU         0x40
#define _PMDIS1_PSPMD           0x80
#define _PMDIS1_PMDPSP          0x80

//==============================================================================


//==============================================================================
//        PD2 Bits

extern __at(0x0EBB) __sfr PD2;

typedef union
  {
  struct
    {
    unsigned CMP1MD             : 1;
    unsigned CMP2MD             : 1;
    unsigned CMP3MD             : 1;
    unsigned TMR5MD             : 1;
    unsigned TMR6MD             : 1;
    unsigned                    : 1;
    unsigned TMR8MD             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PMDCMP1            : 1;
    unsigned PMDCMP2            : 1;
    unsigned PMDCMP3            : 1;
    unsigned PMDTMR5            : 1;
    unsigned PMDTMR6            : 1;
    unsigned                    : 1;
    unsigned PMDTMR8            : 1;
    unsigned                    : 1;
    };
  } __PD2bits_t;

extern __at(0x0EBB) volatile __PD2bits_t PD2bits;

#define _CMP1MD                 0x01
#define _PMDCMP1                0x01
#define _CMP2MD                 0x02
#define _PMDCMP2                0x02
#define _CMP3MD                 0x04
#define _PMDCMP3                0x04
#define _TMR5MD                 0x08
#define _PMDTMR5                0x08
#define _TMR6MD                 0x10
#define _PMDTMR6                0x10
#define _TMR8MD                 0x40
#define _PMDTMR8                0x40

//==============================================================================


//==============================================================================
//        PMDIS2 Bits

extern __at(0x0EBB) __sfr PMDIS2;

typedef union
  {
  struct
    {
    unsigned CMP1MD             : 1;
    unsigned CMP2MD             : 1;
    unsigned CMP3MD             : 1;
    unsigned TMR5MD             : 1;
    unsigned TMR6MD             : 1;
    unsigned                    : 1;
    unsigned TMR8MD             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PMDCMP1            : 1;
    unsigned PMDCMP2            : 1;
    unsigned PMDCMP3            : 1;
    unsigned PMDTMR5            : 1;
    unsigned PMDTMR6            : 1;
    unsigned                    : 1;
    unsigned PMDTMR8            : 1;
    unsigned                    : 1;
    };
  } __PMDIS2bits_t;

extern __at(0x0EBB) volatile __PMDIS2bits_t PMDIS2bits;

#define _PMDIS2_CMP1MD          0x01
#define _PMDIS2_PMDCMP1         0x01
#define _PMDIS2_CMP2MD          0x02
#define _PMDIS2_PMDCMP2         0x02
#define _PMDIS2_CMP3MD          0x04
#define _PMDIS2_PMDCMP3         0x04
#define _PMDIS2_TMR5MD          0x08
#define _PMDIS2_PMDTMR5         0x08
#define _PMDIS2_TMR6MD          0x10
#define _PMDIS2_PMDTMR6         0x10
#define _PMDIS2_TMR8MD          0x40
#define _PMDIS2_PMDTMR8         0x40

//==============================================================================


//==============================================================================
//        PD3 Bits

extern __at(0x0EBC) __sfr PD3;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned CCP4MD             : 1;
    unsigned CCP5MD             : 1;
    unsigned CCP6MD             : 1;
    unsigned CCP7MD             : 1;
    unsigned CCP8MD             : 1;
    unsigned CCP9MD             : 1;
    unsigned CCP10MD            : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned PMDCCP4            : 1;
    unsigned PMDCCP5            : 1;
    unsigned PMDCCP6            : 1;
    unsigned PMDCCP7            : 1;
    unsigned PMDCCP8            : 1;
    unsigned PMDCCP9            : 1;
    unsigned PMDCCP10           : 1;
    };
  } __PD3bits_t;

extern __at(0x0EBC) volatile __PD3bits_t PD3bits;

#define _CCP4MD                 0x02
#define _PMDCCP4                0x02
#define _CCP5MD                 0x04
#define _PMDCCP5                0x04
#define _CCP6MD                 0x08
#define _PMDCCP6                0x08
#define _CCP7MD                 0x10
#define _PMDCCP7                0x10
#define _CCP8MD                 0x20
#define _PMDCCP8                0x20
#define _CCP9MD                 0x40
#define _PMDCCP9                0x40
#define _CCP10MD                0x80
#define _PMDCCP10               0x80

//==============================================================================


//==============================================================================
//        PMDIS3 Bits

extern __at(0x0EBC) __sfr PMDIS3;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned CCP4MD             : 1;
    unsigned CCP5MD             : 1;
    unsigned CCP6MD             : 1;
    unsigned CCP7MD             : 1;
    unsigned CCP8MD             : 1;
    unsigned CCP9MD             : 1;
    unsigned CCP10MD            : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned PMDCCP4            : 1;
    unsigned PMDCCP5            : 1;
    unsigned PMDCCP6            : 1;
    unsigned PMDCCP7            : 1;
    unsigned PMDCCP8            : 1;
    unsigned PMDCCP9            : 1;
    unsigned PMDCCP10           : 1;
    };
  } __PMDIS3bits_t;

extern __at(0x0EBC) volatile __PMDIS3bits_t PMDIS3bits;

#define _PMDIS3_CCP4MD          0x02
#define _PMDIS3_PMDCCP4         0x02
#define _PMDIS3_CCP5MD          0x04
#define _PMDIS3_PMDCCP5         0x04
#define _PMDIS3_CCP6MD          0x08
#define _PMDIS3_PMDCCP6         0x08
#define _PMDIS3_CCP7MD          0x10
#define _PMDIS3_PMDCCP7         0x10
#define _PMDIS3_CCP8MD          0x20
#define _PMDIS3_PMDCCP8         0x20
#define _PMDIS3_CCP9MD          0x40
#define _PMDIS3_PMDCCP9         0x40
#define _PMDIS3_CCP10MD         0x80
#define _PMDIS3_PMDCCP10        0x80

//==============================================================================


//==============================================================================
//        PPSCON Bits

